<a href="https://colab.research.google.com/github/ewertonsilvag/mini_projeto_final_SoulCode/blob/main/Tratamento_dados_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# ***Nível Pandas ***

---

Importando a biblioeteca pandas com o apelido 'pd'

In [ ]:
import pandas as pd

Importando o Dataset do drive para o colab

---

In [ ]:
df = pd.read_csv("/content/drive/MyDrive/SoulCode/MiniProjeto/marketing_campaign.csv - marketing_campaign.csv.csv")

Verificando o DataFrame

In [ ]:
df

         ID  Year_Birth   Education  ... Z_CostContact  Z_Revenue  Response
0      5524        1957  Graduation  ...             3         11         1
1      2174        1954  Graduation  ...             3         11         0
2      4141        1965  Graduation  ...             3         11         0
3      6182        1984  Graduation  ...             3         11         0
4      5324        1981         PhD  ...             3         11         0
...     ...         ...         ...  ...           ...        ...       ...
2235  10870        1967  Graduation  ...             3         11         0
2236   4001        1946         PhD  ...             3         11         0
2237   7270        1981  Graduation  ...             3         11         0
2238   8235        1956      Master  ...             3         11         0
2239   9405        1954         PhD  ...             3         11         1

[2240 rows x 29 columns]

Traduzindo as colunas para o português

In [ ]:
df.rename(columns={'ID': 'id', 'Year_Birth': 'ano_nascimento', 'Education': 'educacao',
                   'Marital_Status': 'estado_civil', 'Income': 'renda', 'Kidhome': 'qtd_crianca',
                   'Teenhome': 'qtd_adolescente', 'Dt_Customer': 'primeira_data_compra', 'Recency': 'dias_desde_ult_compras',
                   'MntWines': 'qtd_vinhos', 'MntFruits': 'qtd_frutas', 'MntMeatProducts': 'qtd_carne',
                   'MntFishProducts' : 'qtd_peixe', 'MntSweetProducts': 'guloseimas','MntGoldProds': 'qtd_produtos_gold',
                   'NumDealsPurchases': 'qtd_ofertas_compra', 'NumWebPurchases': 'qtd_compras_online', 'NumCatalogPurchases': 'qtd_compras_catalogo',
                   'NumStorePurchases': 'qtd_compras_na_loja', 'NumWebVisitsMonth': 'qtd_visitas_online_mes','AcceptedCmp3': 'oferta_aceita1',
                   'AcceptedCmp4': 'oferta_aceita2','AcceptedCmp5': 'oferta_aceita3', 'AcceptedCmp1': 'oferta_aceita4',
                   'AcceptedCmp2': 'oferta_aceita5', 'Complain': 'reclamacao', 'Z_CostContact': 'contato_de_custo',
                   'Z_Revenue': 'receita', 'Response': 'resposta'},inplace=True)

Verificando os tipos de dados das colunas

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   id                      2240 non-null   int64
 1   ano_nascimento          2240 non-null   int64
 2   educacao                2240 non-null   object
 3   estado_civil            2240 non-null   object
 4   renda                   2216 non-null   float64
 5   qtd_crianca             2240 non-null   int64
 6   qtd_adolescente         2240 non-null   int64
 7   primeira_data_compra    2240 non-null   object
 8   dias_desde_ult_compras  2240 non-null   int64
 9   qtd_vinhos              2240 non-null   int64
 10  qtd_frutas              2240 non-null   int64
 11  qtd_carne               2240 non-null   int64
 12  qtd_peixe               2240 non-null   int64
 13  guloseimas              2240 non-null   int64
 14  qtd_produtos_gold       2240 non-null   int64
 15  qtd_ofertas_compra      2240 non-null   int64
 16  qtd_compras_online      2240 non-null   int64
 17  qtd_compras_catalogo    2240 non-null   int64
 18  qtd_compras_na_loja     2240 non-null   int64
 19  qtd_visitas_online_mes  2240 non-null   int64
 20  oferta_aceita1          2240 non-null   int64
 21  oferta_aceita2          2240 non-null   int64
 22  oferta_aceita3          2240 non-null   int64
 23  oferta_aceita4          2240 non-null   int64
 24  oferta_aceita5          2240 non-null   int64
 25  reclamacao              2240 non-null   int64
 26  contato_de_custo        2240 non-null   int64
 27  receita                 2240 non-null   int64
 28  resposta                2240 non-null   int64
dtypes: float64(1), int64(25), object(3)
memory usage: 507.6+ KB

Transformando o tipo de coluna 'primeira_data_compra' de string para data

In [ ]:
df['primeira_data_compra'] = df['primeira_data_compra'].astype('datetime64')

Verificando a alteração

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   id                      2240 non-null   int64
 1   ano_nascimento          2240 non-null   int64
 2   educacao                2240 non-null   object
 3   estado_civil            2240 non-null   object
 4   renda                   2216 non-null   float64
 5   qtd_crianca             2240 non-null   int64
 6   qtd_adolescente         2240 non-null   int64
 7   primeira_data_compra    2240 non-null   datetime64[ns]
 8   dias_desde_ult_compras  2240 non-null   int64
 9   qtd_vinhos              2240 non-null   int64
 10  qtd_frutas              2240 non-null   int64
 11  qtd_carne               2240 non-null   int64
 12  qtd_peixe               2240 non-null   int64
 13  guloseimas              2240 non-null   int64
 14  qtd_produtos_gold       2240 non-null   int64
 15  qtd_ofertas_compra      2240 non-null   int64
 16  qtd_compras_online      2240 non-null   int64
 17  qtd_compras_catalogo    2240 non-null   int64
 18  qtd_compras_na_loja     2240 non-null   int64
 19  qtd_visitas_online_mes  2240 non-null   int64
 20  oferta_aceita1          2240 non-null   int64
 21  oferta_aceita2          2240 non-null   int64
 22  oferta_aceita3          2240 non-null   int64
 23  oferta_aceita4          2240 non-null   int64
 24  oferta_aceita5          2240 non-null   int64
 25  reclamacao              2240 non-null   int64
 26  contato_de_custo        2240 non-null   int64
 27  receita                 2240 non-null   int64
 28  resposta                2240 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(25), object(2)
memory usage: 507.6+ KB

Verificando se a coluna 'id' possui apenas valores únicos para transformá-lo no no meu rótulo

In [ ]:
df.id.is_unique

True

Trocando o rótulo do Data Frama para 'id'

In [ ]:
df.set_index("id", inplace = True)

Mostrando os dados únicos na coluna educação

In [ ]:
df.educacao.unique()

array(['Graduation', 'PhD', 'Master', 'Basic', '2n Cycle'], dtype=object)

Substituindo múltiplos valores por múltiplos valores na coluna educacao

In [ ]:
df['educacao'].replace(['Graduation','PhD', 'Master', 'Basic', '2n Cycle'],['graduacao', 'doutorado', 'mestre', 'ensino_fundamental', 'cursando_mestrado'], inplace=True)

Verificando os dados unicos da coluna estado_civil

In [ ]:
df.estado_civil.unique()

array(['Single', 'Together', 'Married', 'Divorced', 'Widow', 'Alone',
       'Absurd', 'YOLO'], dtype=object)

Substituindo múltiplos valores por múltiplos valores na coluna estado_civil

In [ ]:
df['estado_civil'].replace(['Single','Together', 'Married', 'Divorced', 'Widow'],['solteiro', 'uniao_estavel', 'casado(a)', 'divorciado(a)', 'viúvo(a)'], inplace=True)

Substituindo vários valores com o mesmo valor na coluna estado_civil

In [ ]:
df.replace(['Alone', 'Absurd', 'YOLO'], pd.NA, inplace=True)

Verificando a presença de outros dados nulos

In [ ]:
df.isnull().sum()

ano_nascimento             0
educacao                   0
estado_civil               7
renda                     24
qtd_crianca                0
qtd_adolescente            0
primeira_data_compra       0
dias_desde_ult_compras     0
qtd_vinhos                 0
qtd_frutas                 0
qtd_carne                  0
qtd_peixe                  0
guloseimas                 0
qtd_produtos_gold          0
qtd_ofertas_compra         0
qtd_compras_online         0
qtd_compras_catalogo       0
qtd_compras_na_loja        0
qtd_visitas_online_mes     0
oferta_aceita1             0
oferta_aceita2             0
oferta_aceita3             0
oferta_aceita4             0
oferta_aceita5             0
reclamacao                 0
contato_de_custo           0
receita                    0
resposta                   0
dtype: int64

Verificando os dados unicos da coluna oferta_aceita1

In [ ]:
df.oferta_aceita1.unique()

array([0, 1])

Substituindo múltiplos valores por múltiplos valores na coluna oferta_aceita1

In [ ]:
df['oferta_aceita1'].replace([0,1],['nao', 'sim'], inplace=True)

Substituindo múltiplos valores por múltiplos valores na coluna oferta_aceita2

In [ ]:
df['oferta_aceita2'].replace([0,1],['nao', 'sim'], inplace=True)

Substituindo múltiplos valores por múltiplos valores na coluna oferta_aceita3

In [ ]:
df['oferta_aceita3'].replace([0,1],['nao', 'sim'], inplace=True)

Substituindo múltiplos valores por múltiplos valores na coluna oferta_aceita4

In [ ]:
df['oferta_aceita4'].replace([0,1],['nao', 'sim'], inplace=True)

Substituindo múltiplos valores por múltiplos valores na coluna oferta_aceita5

In [ ]:
df['oferta_aceita5'].replace([0,1],['nao', 'sim'], inplace=True)

Substituindo os valores da coluna reclamação

In [ ]:
df['reclamacao'].replace([0,1],['nao', 'sim'], inplace=True)

Criei uma lista das colunas que não achei relevante para poder apagá-las

In [ ]:
colunas = ['contato_de_custo', 'receita', 'resposta']
df.drop(colunas, axis=1, inplace=True)

Excluindo linhas onde a data de nascimento seja menor que 1914, considerando uma idade máxima de 100 anos

In [ ]:
df.drop(df[df.ano_nascimento < 1914].index, inplace =True)

Verificando se todas as alterações foram salvas

In [ ]:
df

       ano_nascimento   educacao  ... oferta_aceita5  reclamacao
id                                ...
5524             1957  graduacao  ...            nao         nao
2174             1954  graduacao  ...            nao         nao
4141             1965  graduacao  ...            nao         nao
6182             1984  graduacao  ...            nao         nao
5324             1981  doutorado  ...            nao         nao
...               ...        ...  ...            ...         ...
10870            1967  graduacao  ...            nao         nao
4001             1946  doutorado  ...            nao         nao
7270             1981  graduacao  ...            nao         nao
8235             1956     mestre  ...            nao         nao
9405             1954  doutorado  ...            nao         nao

[2237 rows x 25 columns]

In [ ]:
df.to_csv('/content/drive/MyDrive/SoulCode/MiniProjeto/marketing_dataframe.csv', sep=',')